class FoodData {
  static Map<String, Map<String, dynamic>> foods = {
    "ไข่ป่าม": {
      "price": 20,
      "lat": 18.289204450499835,  
      "lng": 99.5015026082682,
      "video": "assets/videos/eggs.mp4",
      "ingredients": ["ไข่ไก่", "ใบตอง", "เกลือ"],
      "steps": ["ตีไข่", "ห่อใบตอง", "ย่าง"],
    },
    "ข้าวซอย": {
      "price": 40,
      "lat": 18.288182291029603, 
      "lng": 99.50265983843391,
      "video": "assets/videos/rices.mp4",
      "ingredients": ["เส้นข้าวซอย", "กะทิ", "เนื้อไก่", "พริกแกง"],
      "steps": ["ทำน้ำแกง", "ต้มเส้น", "จัดเสิร์ฟ"],
    },
    "จอผักกาด": {
      "price": 50,
      "lat": 18.289762358087643, 
      "lng": 99.49584234610668,
      "video": "assets/videos/monitors.mp4",
      "ingredients": ["ผักกาด", "มะเขือเทศ", "กระเทียม"],
      "steps": ["ต้มผัก", "ปรุงรส"],
    },
    "ลาบเหนือ": {
      "price": 60,
      "lat": 18.297197077538673, 
      "lng": 99.49896044724467,
      "video": "assets/videos/larbs.mp4",
      "ingredients": ["หมู", "เครื่องลาบ", "พริก"],
      "steps": ["สับหมู", "คลุกเครื่องลาบ"],
    },

    // ของหวาน
    "ลูกชุบ": {
      "price": 20,
      "lat": 13.766330667521611,  
      "lng": 100.48353524468368,
      "video": "assets/videos/babys.mp4",
      "ingredients": ["ถั่วเขียว", "น้ำตาล", "สีผสมอาหาร"],
      "steps": ["กวนถั่ว", "ปั้น", "เคลือบวุ้น"],
    },
    "ขนมใส่ไส้": {
      "price": 15,
      "lat": 13.279621164263187,  
      "lng": 100.93253765739048,
      "video": "assets/videos/candys.mp4",
      "ingredients": ["แป้งข้าวเหนียว", "มะพร้าว", "น้ำตาล"],
      "steps": ["ทำไส้", "ห่อแป้ง", "นึ่ง"],
    },
    "ขนมชั้น": {
      "price": 15,
      "lat": 13.75217829944441, 
      "lng": 100.47908111060009,
      "video": "assets/videos/floors.mp4",
      "ingredients": ["แป้งมัน", "กะทิ", "น้ำตาล"],
      "steps": ["ผสมแป้ง", "นึ่งเป็นชั้น"],
    },
  };
}
